[
    {
        "category": "",
        "url": "https://www.cna-aiic.ca/dev-cn-en/blogs/cn-content/2021/01/04/tara-leach-creates-first-np-led-clinic-for-sexual",
        "heading": "Tara Leach creates first NP-led clinic for sexual violence, trafficking victims",
        "body": "Fundamentally, Tara Leach (below) believes in patient-centred treatment. She listens to her patients and strives to provide what they tell her they need, whenever they are ready for it. She focuses on their strengths, not their deficits. She starts with believing and validating her patients' experiences."
    },
    {
        "category": "",
        "url": "https://www.canadian-nurse.com/blogs/cn-content/2020/06/01/trauma-informed-care-for-survivors-of-human-traffi",
        "heading": "Trauma-informed care for survivors of human trafficking: An NP-led initiative",
        "body": "As nursing students, we learn a lot about patients. We learn to consider culture, age, religion, and gender when interacting with them. We learn to watch for poor capillary refill, dilated pupils, and elevated blood pressure. We learn to look at the person as a whole, not just as a set of symptoms and a list of medications to memorize, study, and regurgitate on demand. However, despite all this focus on considering the person as a whole, the first time I heard the words “human trafficking” in relation to health care, I was one year into my nursing studies at university, and it was at Ottawa's H.E.A.L.T.H. Clinic."
    },
    {
        "category": "",
        "url": "https://rnj.rnao.ca/feature/finding-hope-and-health-through-focused-care",
        "heading": "Finding hope and health through focused care",
        "body": "NP Tara Leach met 24-year-old Amanda* two years ago when she came into The Ottawa Hospital emergency department complaining of anxiety and suicidal thoughts. Looking to uncover the source of Amanda's distress, Leach screened her for sexual assault and domestic violence. As a sexual assault nurse examiner (SANE) and clinical lead for the hospital's Sexual Assault and Domestic Violence Treatment Centre, Leach is trained to recognize the signs of these kinds of traumas."
    },
    {
        "category": "",
        "url": "https://www.icmec.org/wp-content/uploads/2019/07/Healthcare-Services-for-Trafficked-Persons-6-10-2019.pdf",
        "heading": "Improving Health Care Services for Trafficked Persons: The Complete Toolkit",
        "body": "The toolkit begins with a brief overview of human trafficking and its health implications. This overview is intended to introduce the topic and clarify definitions. The second section of the toolkit, the service-assessment tool, is designed to help evaluate a target facility and identify opportunities for service improvement. This assessment ideally should be completed by multiple staff members, at multiple levels of responsibility in the target organization, as well as multiple external stakeholders in order to obtain diverse perspectives and a comprehensive assessment"
    }

]